export interface SimpleText {
  footer?: string;
  examRules?: string [];
}
export const text: SimpleText = {footer:`Платформа для тестування знань з різних дисциплін. Ця платформа
  допоможе Вам якісно підготуватись до іспитів ЗНО/НМТ.`, 
  examRules: [`Зовнішнє незалежне оцінювання (ЗНО) та Національний мультипредметний тест (НМТ) проводяться
              з метою об’єктивного визначення рівня знань абітурієнтів. Під час тестування заборонено
              користуватися телефонами, підручниками, шпаргалками. Порушення правил може призвести до
              анулювання результатів.`, `Оцінювання відбувається автоматизовано. Кожен тип питання має власну
               систему нарахування балів, описану нижче.`
              ]}