//import { object } from "yup";

export interface SimpleText {
  footer?: string;
  examRules?: string[];
  aboutPage?: {
    about?: string;
    mission?: string;
    vision?: string;
    sucsess?: string[];
    advantages?: string[];
    values?: valuesText[];
  };
}

export interface valuesText {
  title: string;
  description: string;
}

export const text: SimpleText = {
  footer: `Платформа для тестування знань з різних дисциплін. Ця платформа
  допоможе Вам якісно підготуватись до іспитів ЗНО/НМТ.`, 
  
  examRules: [
    `Зовнішнє незалежне оцінювання (ЗНО) та Національний мультипредметний тест (НМТ) проводяться
     з метою об’єктивного визначення рівня знань абітурієнтів. Під час тестування заборонено
     користуватися телефонами, підручниками, шпаргалками. Порушення правил може призвести до
     анулювання результатів.`,
     
    `Оцінювання відбувається автоматизовано. Кожен тип питання має власну
     систему нарахування балів, описану нижче.`
  ],
  
  aboutPage: {
    about: `**ZNOReady** — сучасна освітня платформа, створена для якісної підготовки учнів 
            до *зовнішнього незалежного оцінювання (ЗНО/НМТ)* в Україні. Наша мета — 
            надати кожному студенту інструменти та знання, необхідні для успішного 
            складання іспитів та вступу до обраних вищих навчальних закладів.`,
            
    mission: `Ми прагнемо зробити якісну підготовку до ЗНО доступною для кожного українського 
            учня, незалежно від місця проживання чи фінансових можливостей. Наша платформа 
            поєднує кращі освітні практики з сучасними технологіями для максимальної 
            ефективності навчання.`,
    
    vision: `Створити онлайн-екосистему в Україні для підготовки до іспитів, де навчання є ефективним, 
            цікавим та доступним для всіх. Надати учням можливість якісно оцінити свої знання як із трьох обов'язкових 
            дисциплін, так і з найбільш популярних предметів, які можна обрати як четвертий.`,
  
    values: [
      { 
        title: "Адаптивна програма", 
        description: "Індивідуальний підхід до кожного учня з урахуванням рівня підготовки. Нам цікаві як ті, хто хоче отримати більш-менш прийнятний бал, так і ті, хто хоче отримати результат, близький до максимального." 
      },
      { 
        title: "Якість", 
        description: "Постійно оновлювані матеріали та актуальні тести. Система автоматичної перевірки та миттєвого зворотного зв'язку. Можливість архівації результатів тестування користувачів для подальшого аналізу рівня підготовки." 
      },
      { 
        title: "Інновації", 
        description: "Використання найкращих технологій для навчання. Відеоуроки, вебінари та велика кількість додаткових корисних матеріалів." 
      },
      { 
        title: "Підтримка", 
        description: "Ми поруч 24/7, щоб допомогти та відповісти на питання. Додаткові безкоштовні консультації." 
      },
      { 
        title: "Результат", 
        description: "Звичайно наша головна мета — успіх кожного учня на іспитах. Але система підготовки спрямована на формуванні у учнів міцних знаннь для продовження подальшої освіти." 
      },
      { 
        title: "Команда", 
        description: "Педагоги з багаторічним досвідом підготовки до ЗНО (НМТ), які щиро люблять те, чим займаються, а не просто заробляють гроші." 
      }
    ], 
              
    sucsess: [
      `Наш успіх — це успіх наших студентів. Кожен високий бал на ЗНО — 
        це результат нашої спільної роботи та доказ ефективності нашої методики.`
    ],
    
    advantages: [
      `Наша платформа розроблена з урахуванням усіх вимог Українського центру оцінювання 
        якості освіти. Ми постійно оновлюємо матеріали відповідно до змін у програмі ЗНО, 
        забезпечуючи актуальність та відповідність сучасним стандартам освіти. Тестування можливо проходити як у варіанті 
        тренувально-навчальному, так і у варіанті максимально наближеному до умов реального іспиту.
        Доступна можливість індивідуальної архівації результатів тестування користувачів для подальшого аналізу рівня підготовки.
        Широка база тестів для підготовки базується як на питаннях, що раніше зустрічалися на іспитах, 
        так і на авторських варіантах.`
    ]
  }
};



              